app/View/Components/Header.php

    public function render(): View|Closure|string
    {
        $categories = Category::all();
---
select * from "categories"