app/Livewire/CreatePost.php

insert into "posts" ("user_id", "category_id", "title", "slug", "content", "updated_at", "created_at") values (1, '1', 'Introduction', 'introduction', 'Mes dsljs dsdsjnd sdsns', '2023-11-08 20:43:48', '2023-11-08 20:43:48')
---
    public function save_post()
    {
        // Créer un nouvel article
        $post = new Post();
        $post->user_id = Auth::id();

        // Vérifier si l'utilisateur n'a pas choisi une catégorie, afin de classer le post comme hors-categorie
        $post->category_id = $this->category != null ? $this->category : 1;

        $post->title = $this->title;
        $post->slug = \Str::slug($this->title);
        $post->content = $this->content;

        $post->save();

select "id", "name" from "categories"
---
    public function render()
    {
        // Récupérer les catégories des posts
        $categories = Category::all('id','name');