app/Livewire/ShowPost.php

insert into "comments" ("post_id", "user_id", "content", "updated_at", "created_at") values (1, 1, 'sf', '2023-11-08 20:52:15', '2023-11-08 20:52:15')
---
    public function add_comment()
    {
        $comment = new Comment();
        $comment->post_id = $this->post->id;
        $comment->user_id = Auth::id();
        $comment->content = $this->content;
        $comment->save();