app/Http/Controllers/CategoryController.php

    public function categories()
    {
        // Récupérer les catégories
        $categories = Category::all();
---
select * from "categories"

    public function create(Request $request)
    {
        // Création de la catégorie
        $category = new Category();
        $category->name = $request->name;

        /**
         * Recupérer la photo et ses informations*
        */

        $file = $request->file('photo');
        $file_extension = $file->getClientOriginalExtension();
        $file_name = (Category::count() + 1) . '.' . $file_extension;

        $file->storeAs('avatars',$file_name,'public');

        /**
        * --- Fin du traitement de la photo ---
        */
        // Stocker le nom de la photo dans la base de données
        $category->photo = $file_name;

        $category->save();
---
select count(*) as aggregate from "categories"
insert into "categories" ("name", "photo", "updated_at", "created_at") values ('Larevel 2', '4.jpeg', '2023-11-08 21:00:23', '2023-11-08 21:00:23')