app/Http/Controllers/ContactController.php

    public function messages()
    {
        // Récupérer toutes les demandes de contact
        $messages = Contact::orderBy('id','desc')->paginate(10);
---
select count(*) as aggregate from "contacts"