app/Http/Controllers/PostController.php

    public function all()
    {
        // Récupérer tous les posts, les paginer et les envoyer à la vue
        $posts = Post::with(['user','category'])
                    ->orderBy('id','desc')
                    ->paginate(10);
---
select * from "categories" where "categories"."id" in (1)
select * from "posts" order by "id" desc limit 10 offset 0
select * from "users" where "users"."id" in (1)
select count(*) as aggregate from "posts"

    public function category($category)
    {
        // Recupérer les posts d'une certaine catégorie
        $posts = Post::with(['user','category'])
                        ->where('category_id', $category)
                        ->orderBy('created_at','desc')
                        ->paginate(10);
---
select count(*) as aggregate from "posts" where "category_id" = '2'

    public function show(Post $post) : View
    {
        // Charger le post avec toutes les rélations
        $post->load(['comments.user','user:id']);
---
select "id" from "users" where "users"."id" in (1)
select * from "comments" where "comments"."post_id" in (1)